[
  {
    "name": "Super Mario Odyssey",
    "img": "https://cdn.mobygames.com/covers/10038039-super-mario-odyssey-nintendo-switch-front-cover.jpg",
    "descripcion": "Explore incredible places far from the Mushroom Kingdom as you join Mario and his new ally Cappy on a massive, globe-trotting 3D adventure. Use amazing new abilities—like the power to capture and control objects, animals, and enemies—to collect Power Moons so you can power up the Odyssey airship and save Princess Peach from Bowser's wedding plans! Thanks to heroic, hat-shaped Cappy, Mario's got new moves that'll make you rethink his traditional run-and-jump gameplay—like cap jump, cap throw, and capture. Use captured cohorts such as enemies, objects, and animals to progress through the game and uncover loads of hidden collectibles. And if you feel like playing with a friend, just pass them a Joy-Con™ controller! Player 1 controls Mario while Player 2 controls Cappy. This sandbox-style 3D Mario adventure—the first since 1996's beloved Super Mario 64™ and 2002's Nintendo GameCube™ classic Super Mario Sunshine™—is packed with secrets and surprises, plus exciting new kingdoms to explore. Explore astonishing new locales like skyscraper-packed New Donk City to your heart's content, and run into familiar friends and foes as you try to save Princess Peach from Bowser's dastardly wedding plans. Find something interesting? Toss your cap at it and see what happens! There are lots of fun and surprising ways to interact with your surroundings. Be sure to bring any coins you find to a Crazy Cap store, where you can exchange them for decorative souvenirs for the Odyssey and new outfits for Mario! Some destinations have very exclusive dress codes, after all… Hand a Joy-Con™ controller to a friend to enjoy simultaneous multiplayer: Player 1 controls Mario while Player 2 controls Mario's new ally Cappy. Use Snapshot Mode to freeze time while playing the game and take screenshots that you can customize using various options and filters. Screenshots can be shared via social media or uploaded to PCs and smart devices* using all of the Nintendo Switch™ system's built-in screenshot tools. A special edition Nintendo Switch™ hardware bundle will launch alongside the game. This special edition includes a download code for the full game, red left and right Joy-Con™ controllers, and a Super Mario Odyssey™ themed Nintendo Switch carrying case. Source: Nintendo.com Description",
    "score": 94
  },
  {
    "name": "The Legend of Zelda: Breath of the Wild",
    "img": "https://cdn.mobygames.com/covers/8437180-the-legend-of-zelda-breath-of-the-wild-nintendo-switch-front-cov.jpg",
    "descripcion": "Step into a world of adventure Forget everything you know about The Legend of Zelda games. Step into a world of discovery, exploration, and adventure in The Legend of Zelda: Breath of the Wild, a boundary-breaking new game in the acclaimed series. Travel across vast fields, through forests, and to mountain peaks as you discover what has become of the kingdom of Hyrule In this stunning Open-Air Adventure. Now on Nintendo Switch, your journey is freer and more open than ever. Take your system anywhere, and adventure as Link any way you like. Features: Explore the wilds of Hyrule any way you like—anytime, anywhere! Climb up towers and mountain peaks in search of new destinations, then set your own path to get there and plunge into the wilderness. Along the way, you'll battle towering enemies, hunt wild beasts and gather ingredients for the food and elixirs you'll make to sustain you on your journey. With Nintendo Switch, you can literally take your journey anywhere. More than 100 Shrines of Trials to discover and explore - Shrines dot the landscape, waiting to be discovered in any order you want. Search for them in various ways, and solve a variety of puzzles inside. The tasks you must perform in each Shrine varies, and you'll never expect the challenges you'll face until you enter. Some will involve realistic physics, and some will require you to harness the power of nature, including electricity, wind, fire, and more. Work your way through the traps and devices inside, utilizing your runes and think outside the box to earn special items and other rewards that will help you on your adventure. Be prepared and properly equipped – With an entire world waiting to be explored, you'll need a variety of outfits and gear to reach every corner. You may need to bundle up with warmer clothes or change into something better suited to the desert heat. Some clothing even has special effects that, for example, can make you faster or stealthier. Battling enemies requires strategy – The world is inhabited with enemies of all shapes and sizes. Each one has its own attack method and weaponry, so you must think quickly and develop the right strategies to defeat them. amiibo compatibility – The Wolf Link amiibo from Twilight Princess HD, the Zelda 30th Anniversary series amiibo, and The Legend of Zelda: Breath of the Wild series amiibo are all compatible with this game. Tap the Wolf Link amiibo (sold separately) to make Wolf Link appear in the game. Wolf Link will attack enemies on his own and help you find items you’re searching for. Tap a Zelda 30th Anniversary series amiibo to receive helpful in-game items or even a treasure chest! Source: Nintendo.com Description",
    "score": 94
  },
  {
    "name": "The Legend of Zelda: Tears of the Kingdom",
    "img": "https://cdn.mobygames.com/covers/17111253-the-legend-of-zelda-tears-of-the-kingdom-nintendo-switch-front-c.jpg",
    "descripcion": "Explore the vast land—and skies—of Hyrule An epic adventure awaits in the Legend of Zelda: Tears of the Kingdom game, only on the Nintendo Switch system. In this sequel to the Legend of Zelda: Breath of the Wild game, you’ll decide your own path through the sprawling landscapes of Hyrule and the mysterious islands floating in the vast skies above. Can you harness the power of Link’s new abilities to fight back against the malevolent forces that threaten the kingdom? Explore Link must travel across the far-reaching land and skies of Hyrule to discover the origins of the mysterious gloom that is plaguing the kingdom. Create Use Link’s powerful new abilities like Ultrahand and Fuse to make audacious weapons and craft creative ways to travel across the landscape. Create Discover Find new ways to build, battle, and play as you try to uncover the secret menace that threatens Hyrule.",
    "score": 93
  },
  {
    "name": "Metroid Prime: Remastered",
    "img": "https://cdn.mobygames.com/covers/15551820-metroid-prime-remastered-nintendo-switch-front-cover.jpg",
    "descripcion": "Metroid Prime: Remastered is a remastered version of the original Metroid Prime first released on the GameCube in 2002. This is the first version of the game for the Nintendo Switch and it remastered with revamped high-definition visuals and modernized audio. The game supports a modern dual-analog control setup as well as a more traditional setup inspired by the release of the game for the GameCube and Metroid Prime Trilogy for Nintendo Wii. There is a new casual difficulty option that reduces the amount of damage Samus takes in combat. Bonus content includes concept and development art for both the original game and the remaster as well as a soundtrack gallery and 3D character gallery.",
    "score": 93
  },
  {
    "name": "Hollow Knight",
    "img": "https://cdn.mobygames.com/covers/7811792-hollow-knight-linux-front-cover.jpg",
    "descripcion": "Brave the Depths of a Forgotten Kingdom Beneath the fading town of Dirtmouth sleeps an ancient, ruined kingdom. Many are drawn below the surface, searching for riches, or glory, or answers to old secrets. Hollow Knight is a classically styled 2D action adventure across a vast interconnected world. Explore twisting caverns, ancient cities and deadly wastes; battle tainted creatures and befriend bizarre bugs; and solve ancient mysteries at the kingdom's heart. ## Game Features Classic side-scrolling action, with all the modern trimmings. Tightly tuned 2D controls. Dodge, dash and slash your way through even the most deadly adversaries. Explore a vast interconnected world of forgotten highways, overgrown wilds and ruined cities. Forge your own path! The world of Hallownest is expansive and open. Choose which paths you take, which enemies you face and find your own way forward. Evolve with powerful new skills and abilities! Gain spells, strength and speed. Leap to new heights on ethereal wings. Dash forward in a blazing flash. Blast foes with fiery Soul! Equip Charms! Ancient relics that offer bizarre new powers and abilities. Choose your favourites and make your journey unique! An enormous cast of cute and creepy characters all brought to life with traditional 2D frame-by-frame animation. Over 130 enemies! 30 epic bosses! Face ferocious beasts and vanquish ancient knights on your quest through the kingdom. Track down every last twisted foe and add them to your Hunter's Journal! Leap into minds with the Dream Nail. Uncover a whole other side to the characters you meet and the enemies you face. Beautiful painted landscapes, with extravagant parallax, give a unique sense of depth to a side-on world. Chart your journey with extensive mapping tools. Buy compasses, quills, maps and pins to enhance your understanding of Hollow Knight’s many twisting landscapes. A haunting, intimate score accompanies the player on their journey, composed by Christopher Larkin. The score echoes the majesty and sadness of a civilisation brought to ruin. Complete Hollow Knight to unlock Steel Soul Mode, the ultimate challenge! ## An Evocative Hand-Crafted World The world of Hollow Knight is brought to life in vivid, moody detail, its caverns alive with bizarre and terrifying creatures, each animated by hand in a traditional 2D style. Every new area you’ll discover is beautifully unique and strange, teeming with new creatures and characters. Take in the sights and uncover new wonders hidden off of the beaten path. If you like classic gameplay, cute but creepy characters, epic adventure and beautiful, gothic worlds, then Hollow Knight awaits! Source: Steam Store Description",
    "score": 91
  },
  {
    "name": "Mario Kart 8 Deluxe",
    "img": "https://cdn.mobygames.com/covers/10074207-mario-kart-8-deluxe-nintendo-switch-front-cover.jpg",
    "descripcion": "This enhanced port of Mario Kart 8 includes the base game, all patches from the Wii U version, and all content from the following DLC packages: Mario Kart 8: Mercedes-Benz × Mario Kart 8 Mario Kart 8: The Legend of Zelda × Mario Kart 8 Mario Kart 8: Animal Crossing × Mario Kart 8 It also features the following changes and additions, which are completely unique to this version of the game: Inkling Boy, Inkling Girl, King Boo, Dry Bones, Bowser Jr., and Gold Mario as playable characters Koopa Clown, Inkstriker, and Splat Buggy as playable vehicles Feather and Boo items, the former of which is only available in Battle Mode The ability to carry two items at once Battle Mode has been revamped and now uses its own exclusive courses 200cc is now playable in Time Trials Various minor gameplay and graphical improvements and adjustments More",
    "score": 90
  },
  {
    "name": "Celeste",
    "img": "https://cdn.mobygames.com/covers/3148568-celeste-linux-front-cover.jpg",
    "descripcion": "Help Madeline survive her inner demons on her journey to the top of Celeste Mountain, in this super-tight, hand-crafted platformer from the creators of multiplayer classic TowerFall. A narrative-driven, single-player adventure like mom used to make, with a charming cast of characters and a touching story of self-discovery A massive mountain teeming with 600+ screens of hardcore platforming challenges and devious secrets Brutal B-side chapters to unlock, built for only the bravest mountaineers IGF “Excellence in Audio” finalist, with over 2 hours of original music led by dazzling live piano and catchy synth beats Pie The controls are simple and accessible - simply jump, air-dash, and climb - but with layers of expressive depth to master, where every death is a lesson. Lightning-fast respawns keep you climbing as you uncover the mysteries of the mountain and brave its many perils. This is it, Madeline. Just breathe. You can do this. Source: Steam Store Description",
    "score": 86
  },
  {
    "name": "Super Mario Bros. Wonder",
    "img": "https://cdn.mobygames.com/covers/17807193-super-mario-bros-wonder-nintendo-switch-front-cover.jpg",
    "descripcion": "The next evolution of Mario fun Classic Mario gameplay is turned on its head with Wonder Flowers in the Super Mario Bros. Wonder game! These game-changing items can make some wonderfully weird stuff happen. Witness pipes coming alive, wreak havoc as a giant Spike-Ball, and lots more! Welcome to the Flower Kingdom Mario and friends have been invited to visit the colorful Flower Kingdom, just a short hop away from the Mushroom Kingdom. Unfortunately, King Bowser has transformed into a flying castle and is causing chaos across their peaceful land. Now our heroes must save the day—and the Flower Kingdom—in this wonderous new adventure! Share the wonder with friends and family You can team up with up to three friends locally on one Nintendo Switch™️ system and race though these wacky worlds together, or play with others online!* Source: Nintendo.com product page",
    "score": 89
  },
  {
    "name": "Hades",
    "img": "https://cdn.mobygames.com/covers/6010163-hades-windows-front-cover.png",
    "descripcion": "Hades is a rogue-like dungeon crawler in which you defy the god of death as you hack and slash your way out of the Underworld of Greek myth. The player takes the role of Zagreus, the prince of the Underworld, who is trying to escape the realm to get away from his dispassionate father, Hades, and reach Mount Olympus. His quest is supported by the other Olympians, who grant him gifts to help fight through the beings that protect the exit from the Underworld. The game is presented in an isometric view with the player in control of Zagreus. The player starts a run-through of the game by trying to fight their way through several rooms; the room layouts are pre-determined, but their order and the enemies that appear are randomly determined. The player has a primary weapon, a special attack, and a magic spell which they can use to take out enemies. Sometimes on clearing a room, one of the Olympians will provide a gift, a choice of three persistent boosts for that run that the player can select from; the gifts are themed based on the Olympian, for example with Zeus providing lightning damage effects. The player also collects in-game currency and potentially keys. Should Zagreus' health points drop to zero, he \"dies\" and ends back up facing his father, removing all gifts granted from the last run. In this area, before settling on a new quest, the player can use the currency to unlock permanent upgrades for Zagreus, or the keys to unlock different weapons.",
    "score": 87
  },
  {
    "name": "Super Smash Bros. Ultimate",
    "img": "https://cdn.mobygames.com/covers/4298102-super-smash-bros-ultimate-nintendo-switch-front-cover.jpg",
    "descripcion": "Gaming icons clash in the ultimate brawl you can play anytime, anywhere! Smash rivals off the stage as new characters Simon Belmont and King K. Rool join Inkling, Ridley, and every fighter in Super Smash Bros. history. Enjoy enhanced speed and combat at new stages based on the Castlevania series, Super Mario Odyssey, and more! Having trouble choosing a stage? Then select the Stage Morph option to transform one stage into another while battling—a series first! Plus, new echo fighters Dark Samus, Richter Belmont, and Chrom join the battle. Whether you play locally or online, savor the faster combat, new attacks, and new defensive options, like a perfect shield. Jam out to 900 different music compositions and go 1-on-1 with a friend, hold a 4-player free-for-all, kick it up to 8-player battles and more! Feel free to bust out your GameCube controllers—legendary couch competitions await—or play together anytime, anywhere! Source: Nintendo.com Description",
    "score": 89
  },
  {
    "name": "Persona 5: Royal",
    "img": "https://cdn.mobygames.com/covers/11199918-persona-5-royal-windows-apps-front-cover.jpg",
    "descripcion": "This Windows release contains the base game Persona 5: Royal and over 40 pieces of DLC. It is the first release of the game for the platform.",
    "score": 91
  },
  {
    "name": "Xenoblade Chronicles 3",
    "img": "https://cdn.mobygames.com/covers/10972789-xenoblade-chronicles-3-nintendo-switch-front-cover.jpg",
    "descripcion": "“Fighting to live…and living to fight” Bringing together the futures of Xenoblade Chronicles and Xenoblade Chronicles 2, this title will take players to the world of Aionios, home to two hostile nations. Keves: a nation where mechanical technology was developed. Their armies are composed of units consisting mainly of combat vehicles. They use units of small, mobile weapons operated by soldiers riding them. Agnus: a nation strong in ether, a magical technology. Their forces are built around units that specialise in ether combat, and they fight with small, mobile, autonomous weapons that use ether technology. Six soldiers hailing from these nations, will take part in a grand tale with life as its central theme. Source: Nintendo.com.au Description",
    "score": 88
  },
  {
    "name": "Bayonetta 2",
    "img": "https://cdn.mobygames.com/covers/8475269-bayonetta-2-wii-u-front-cover.jpg",
    "descripcion": "Bayonetta 2 is the sequel to Bayonetta. You play as Bayonetta, an Umbran Witch who is out to rescue her friend Jeanne from the depths of Inferno. The game is set a few months after the events of the first game. Along the way she has to battle a host of angels and demons who are out to stop her. This is a 3rd-person action game in the mold of Devil May Cry or God of War, fighting multiple enemies and combining different moves based on melee combat and gunplay. The game is all about pulling off fantastic combos with precise timing as you face a number of memorable battles in a variety of locations. By dodging incoming attacks at the last second, Witch Time is activated, slowing down time with an opportunity to retaliate. This technique is also used to solve environmental puzzles. Once again additional points are earned through torture attacks where enemies can be trapped in infernal devices. As in the previous game there is a large amount of customization for the weapons Bayonetta can use with both hand and feet. Umbran Climax is a new gameplay element. It is activated with a full magic gauge, providing health and enhancing damage and radius.",
    "score": 91
  },
  {
    "name": "Inside",
    "img": "https://cdn.mobygames.com/covers/1104706-inside-xbox-one-front-cover.png",
    "descripcion": "Inside is a cinematic platformer with many game mechanics similar to the developer's previous game Limbo. The player controls a young boy and it starts with no context as he climbs down a rock at night in a dark forest. There are no conversations or explanations in the game, but the events reveal it is set in a dystopian universe where sinister experiments are performed on humans or human-like creatures. As in Limbo the boy needs to solve environment based puzzles, hide from people and animals, escape in chase sequences and complete sections with platform mechanics. The boy moves in a hostile environment and cannot be spotted, but it is not explained if he escaped or deliberately seeks out the mystery. There is no HUD and controls are limited to movement, jumping, and grabbing objects to operate them or to move them around. Progress often involves trial and error to test different options as every challenge usually requires a new approach. He dies often and at times in gruesome ways. The boy can operate elevators, climb or swing from chains and ropes, swim underwater, operate a tiny submarine and so on. There is also a mechanic involving mind control to control other characters. Later on in the game a small group of characters can be gathered and they follow him around automatically. They can help him lift doors or push objects, or throw him in the air. There are no hints, so the player always needs to figure out what to do and where to go. Similar to Limbo the game has a dark environment, but here with sparse use of colour. Checkpoints are activated automatically and chapters can be revisited at any moment using a menu. Optionally certain hidden objects can be located and disabled, along with an alternate ending to discover. There is a lot of suspense and tense moments in the game, but also scenes that focus entirely on solving a puzzle with no pressure. More",
    "score": 86
  },
  {
    "name": "Metroid Dread",
    "img": "https://cdn.mobygames.com/covers/10149223-metroid-dread-nintendo-switch-front-cover.jpg",
    "descripcion": "Upon investigating a mysterious transmission on Planet ZDR, Samus faces a mysterious foe that traps her in this dangerous world. The remote planet has been overrun by vicious alien lifeforms and murderous robots called E.M.M.I. Hunt or be hunted as you make your way through a labyrinth of enemies in Samus’ most intense side-scrolling adventure yet. Samus is more agile and capable than ever Guide Samus Aran, an intergalactic bounty hunter raised by an ancient tribe, and traverse the many environments of a dangerous world. Parkour over obstacles, slide through tight spaces, counter enemies, and battle your way through the planet. Through her countless missions, Samus has never experienced a threat like the dread of ZDR. Power up and find more ways to explore and secrets to uncover Gain abilities and return to previous areas to find new areas and hidden upgrades in classic Metroid™ gameplay. Planet ZDR’s sprawling map is home to many secrets to discover and powers to find. You’ll need to be prepared to evade and destroy E.M.M.I. robots and overcome the dread plaguing ZDR. A new Samus amiibo™ figure featuring her suit from Metroid Dread and an E.M.M.I. amiibo figure are available in a 2-pack set. Scan the Samus amiibo for an extra energy tank to increase your health by 100; additionally, the Samus amiibo can be tapped again to receive health once per day. The E.M.M.I. amiibo grants Samus a Missile Plus tank, increasing her missile capacity by 10; additionally, the E.M.M.I. amiibo can be tapped again to replenish some missiles once per day. Source: Nintendo.com Description",
    "score": 87
  },
  {
    "name": "Paper Mario: The Thousand-Year Door",
    "img": "https://cdn.mobygames.com/covers/18765137-paper-mario-the-thousand-year-door-nintendo-switch-front-cover.jpg",
    "descripcion": "Join Mario on an epic paper-adventure to collect the Crystal Stars before the X-Nauts do! The nefarious X-Nauts are after the treasure behind the Thousand-Year Door! With a map from Princess Peach, and the help of a few locals, Mario journeys through a colorful world made of paper to find them first. To prevail in this quest, you’ll have to level up Mario and his friends, master timing-based attacks and badges to impress the audience on the stage of combat, and make use of all the abilities that come with being cursed—er, conveniently made of paper—like folding into a plane to cross big gaps or turning sideways to slip through narrow openings. Leaf through a storybook world with charming characters in every fold Surprises abound in this deep and engaging tale, where everyone’s got something to say and it’s often not what you’d expect. Mario will meet all kinds of interesting folks on his journey, like the upbeat and studious Goombella and the shy but determined Koops. Some of these characters will need your help with their own quests, or even join your party. Others, like Peach and Bowser, have stories of their own that you’ll play between Mario’s chapters! A classic turns the page, bringing fresh visuals and updated features Twenty years after the original game on the Nintendo GameCube™ system, this version for the Nintendo Switch™ system has revamped graphics, an updated soundtrack, and gameplay additions like updated quick-travel pipes and a Partner Ring to swap characters in a jiffy. There are some additional improvements too—visit the Battle Master if you need help with combat, access a hint system if you’re stuck, equip the Nostalgic Tunes badge to play using the original soundtrack, and more! Source: Nintendo.com Description",
    "score": 87
  },
  {
    "name": "Chained Echoes",
    "img": "https://cdn.mobygames.com/covers/11178902-chained-echoes-windows-apps-front-cover.jpg",
    "descripcion": "Chained Echoes is a story-driven JRPG where a group of heroes travel around the vast continent of Valandis to bring an end to the war between its three kingdoms. In the course of their journey, they will travel through a wide array of diverse landscapes spanning from wind-tanned plateaus and exotic archipelagos to sunken cities and forgotten dungeons. Take up your sword, channel your magic or board your Mech. Chained Echoes is a 16-bit SNES style RPG set in a fantasy world where dragons are as common as piloted mechanical suits. Follow a group of heroes as they explore a land filled to the brim with charming characters, fantastic landscapes and vicious foes. Can you bring peace to a continent where war has been waged for generations and betrayal lurks around every corner?## Key Features: 30 - 40 hours of play time Fast paced turn-based battles No random encounters; enemies can be seen running around Tons of items to be looted, stolen or crafted Complex skill and equipment system Customize your own airship Travel and fight by foot or in your Mech 16-bit SNES style graphics Music inspired by PSX RPGs Source: Steam Store Description",
    "score": 88
  },
  {
    "name": "Dragon Quest XI S: Echoes of an Elusive Age - Definitive Edition",
    "img": "https://cdn.mobygames.com/covers/8215208-dragon-quest-xi-s-echoes-of-an-elusive-age-definitive-edition-ni.jpg",
    "descripcion": "With a ragtag band of adventurers, you’ll engage in well-balanced, turn-based battles and embark on quests across the kingdom of Erdrea. Forge gear, develop party members’ skills, and alter their outfits without changing gear in this edition of the game! This version also lets you ride and attack with monsters on the field to earn experience points, as well as change between HD or 16-bit visuals, symphonic or synth music, and English or Japanese audio. Complete the tale with new character-focused stories, and travel to past DRAGON QUEST worlds! Across the land, you’ll meet the mysterious Tockles—creatures that allow you to visit 2D, 16-bit versions of areas from popular entries in the series like DRAGON QUEST IV and DRAGON QUEST VIII! It’s fun to see these classic worlds reimagined in retro style, meshing perfectly with the main game’s 2D mode. Like all past DRAGON QUEST games, this one’s character designs are based on the signature style of famed artist Akira Toriyama. Paired with the voiced dialogue, the rich personalities of your most loyal companions and fiercest enemies are brought to life, so you can fully immerse yourself in this quest to discover the Luminary’s true heritage and awaken your power. For a greater challenge, start the game with the Draconian Quest setting, and capture your favorite moments with Photo Mode! A sprawling RPG with the most impressive scope in the DRAGON QUEST® series Complete the tale with new character-based stories that offer additional background Travel to past DRAGON QUEST® worlds, wear outfits without changing gear, and ride and attack with monsters! Change between HD or 16-bit graphics, synthesized or symphonic music, and English or Japanese voices Wage turn-based battles against monsters and bosses by commanding a party of adventurers Strategically combine your party members’ moves into special attacks with the Pep System Complete side-quests and mini-games while exploring the expansive terrains and cities of Erdrea The Draconian Quest difficulty setting offers an even greater challenge Snap shots of your favorite moments with Photo Mode Source: Nintendo.com Description",
    "score": 87
  },
  {
    "name": "Super Mario 3D World + Bowser’s Fury",
    "img": "https://cdn.mobygames.com/covers/9895396-super-mario-3d-world-bowsers-fury-nintendo-switch-front-cover.jpg",
    "descripcion": "Pounce and climb through dozens of colorful courses! Mario (and his friends) can use a variety of power-ups like the Super Bell, which grants catlike abilities like climbing and scratching. Team up with up to three other players locally* or online** to reach the goal and see who can get a high score. Explore a seamless feline world in the new Bowser’s Fury adventure Free-roaming Super Mario gameplay makes a return in this brand-new adventure. Bowser has become gargantuan and lost all control! Explore Lake Lapcat and its islands, complete objectives to collect Cat Shines, and team up with Bowser Jr. to bring his big, bad dad back to normal. Just watch out for Bowser’s island-wide attacks. New and improved features pounce in The Super Mario 3D World + Bowser’s Fury game features the same great co-op gameplay, creative levels and power-ups as the original game, but with added improvements. In the Super Mario 3D World part of the game, characters move faster and the dash powers up more quickly. Both adventures support the newly added Snapshot Mode—pause the action to get the perfect shot, apply filters, and decorate with stamps! In Super Mario 3D World, choose from Mario, Luigi, Peach, and Toad and set off to save the Sprixie Kingdom. Each character has a distinct playstyle—Luigi can jump extra high and Peach can float for a short time. Rosalina is also available as a playable character later in the game! Jump, dash, and pounce to reach the goal while collecting Green Stars, coins and power-ups. Collect stamps throughout your adventure in Super Mario 3D World and use them in Snapshot Mode (in both Super Mario 3D World and the Bowser’s Fury adventure) to create masterpieces to share with friends and family. In Bowser’s Fury, Mario arrives on Lake Lapcat and is confronted with a rampaging Bowser! Join forces with Bowser Jr. and venture through an interconnected world made of cat-themed…well, everything. Enemies, flowers, and even birds take on a feline form. Need some extra assistance bringing Bowser out of his frenzied, furious state? Another player can take control of Bowser Jr. and help out by attacking enemies and storing power-ups. Two sets of claws are better than one! Source: Nintendo.com Description",
    "score": 87
  },
  {
    "name": "The House in Fata Morgana: Dreams of the Revenants Edition",
    "img": "https://cdn.mobygames.com/covers/10073407-the-house-in-fata-morgana-dreams-of-the-revenants-edition-playst.jpg",
    "descripcion": "The House in Fata Morgana: Dreams of the Revenants Edition is the first release for Nintendo Switch and PlayStation 4 and is a compilation of: The House in Fata Morgana The House in Fata Morgana: A Requiem for Innocence A new story sequel has been added, dubbed Reincarnation. New and reworked CGI, backgrounds and stills have been updated, voice acting, as well as support for 4K high image quality. Additional short stories which haven't been released before are added.",
    "score": 85
  },
  {
    "name": "Lorelei and the Laser Eyes",
    "img": "https://cdn.mobygames.com/covers/18660621-lorelei-and-the-laser-eyes-nintendo-switch-front-cover.jpg",
    "descripcion": "A woman, summoned by an eccentric man to participate in a project in an old hotel somewhere in central Europe, becomes embroiled in a game of illusions, increasingly dangerous and surreal. Now you are invited to fall into the same rabbit hole, in a non-linear mystery with an immense amount of handcrafted puzzles, constantly presenting you with new riddles to solve, each leading you closer to deciphering the enigma of Lorelei and the Laser Eyes. Source: Steam Store Description",
    "score": 87
  },
  {
    "name": "13 Sentinels: Aegis Rim",
    "img": "https://cdn.mobygames.com/covers/9065248-13-sentinels-aegis-rim-playstation-4-front-cover.jpg",
    "descripcion": "Vanillaware, the storytellers behind Odin Sphere and Dragon’s Crown, craft a sci-fi mystery epic spanning thirteen intertwining stories in 13 Sentinels: Aegis Rim. Uncover the truth and delve into a 2D sidescrolling adventure featuring gorgeous art and environments. Then, battle the kaiju in fast-paced, top-down combat. Customize the Sentinels with an arsenal of mechsuit weaponry, and fight to defend humanity! Offline single player Uses DUALSHOCK 4 vibration function Enhanced game play on PS4 Pro console Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). Software subject to license (us.playstation.com/softwarelicense). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account. Source: PlayStation Store Description",
    "score": 86
  },
  {
    "name": "Tetris Effect",
    "img": "https://cdn.mobygames.com/covers/3428486-tetris-effect-playstation-4-front-cover.png",
    "descripcion": "Tetris® Effect is Tetris like you've never seen it, or heard it, or felt it before—an incredibly addictive, unique, and breathtakingly gorgeous reinvention of one of the most popular puzzle games of all time, from the people who brought you the award-winning Rez Infinite and legendary puzzle game Lumines. Fully playable on either a standard display (up to 4K and 60fps on a PS4™Pro), or optionally in mind-blowing 3D on PS VR. Music, backgrounds, sounds, special effects—everything, down to the Tetris pieces themselves, pulse, dance, shimmer, and explode in perfect sync with how you're playing, making any of the game's 30+ stages and 10+ modes something you'll want to experience over and over again. A challenge for the mind and a feast for all the senses, TETRIS EFFECT is the perfect excuse to play Tetris again... and again...and again, and again, and again and again and again and again and again and again and... 1 player 4GB minimum save size DUALSHOCK®4 PlayStation®VR Compatible PlayStation®Camera Compatible Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account. Tetris ® & © 1985~2018 Tetris Holding. Tetris logos, Tetris theme song and Tetriminos are trademarks of Tetris Holding. The Tetris trade dress is owned by Tetris Holding. Licensed to The Tetris Company. Tetris Game Design by Alexey Pajitnov. Tetris Logo Design by Roger Dean. All Rights Reserved. Tetris Effect produced and published by Enhance, Inc. Developed by Resonair and Monstars Inc. All Rights Reserved.Fully playable on either a standard display (up to 4K and 60fps on a PS4™Pro), or optionally in mind-blowing 3D on PS VR. Source: PlayStation Store Description",
    "score": 89
  },
  {
    "name": "Theatrhythm: Final Bar Line",
    "img": "https://cdn.mobygames.com/covers/18191833-theatrhythm-final-bar-line-nintendo-switch-front-cover.jpg",
    "descripcion": "Theatrhythm: Final Bar Line is a rhythm game in the long-running handheld series coming to consoles for the first time. You form a team of popular characters and play along to music tracks from across the Final Fantasy franchise. There are two general stage types, Battle Music Stages and Field Music Stages, and three note types: press, hold, and analog direction. Battle Music Stages have a four lane track and will often have multiple simultaneous notes on higher difficulties. Field Music Stages have a single lane with hold notes that must be tracked with an analog stick as they go up and down.",
    "score": 86
  },
  {
    "name": "Balatro",
    "img": "https://cdn.mobygames.com/covers/19339043-balatro-xbox-one-front-cover.png",
    "descripcion": "Balatro is a strategic card game with a roguelike structure influenced by the Cantonese card game Big Two and Luck be a Landlord. A game is played as a run that is different every time because of various parameters and random elements. It is up to the player to organize and enhance a standard deck of 52 cards to complete the run, which ends the game. During runs various elements are unlocked permanently, but as is typical for a roguelike, most of the items and progress are lost as soon as the run is over, whether it was completed successfully or not. A run is divided into multiple steps called Blinds with a limited number of hands. If a Blind cannot be completed because the requirements are not met, the game is over right away. Scoring in the game is based around the standard hands of the Poker such as a high card, a pair, a flush or a full house. There are however a lot of game elements that add to the strategy. There is a cash system where money between Blinds can be spent on new cards and card modifications. For instance, both individual cards and hands can be upgraded, making a pair earn more than a straight. The standard deck can contain enhanced cards of various types, but players can also destroy cards, removing them permanently, or introduce new cards. That way, it is for instance possible to get rid of some Jacks and replace them with additional aces instead. Unlike as is common in most deck building games, it is possible to run out of cards in a single Blind when all of them have been dealt. Other game elements are Joker cards that provide bonuses and multipliers and single-use tarot cards that can be used at specific moments for a strategic advantage. In the third and final Blind of a round the player is often challenged to work around certain restrictions, such as hidden cards, debuffed cards or only allowing a specific hand to be played. The roguelike structure is further deepened by unlocking specific starting decks and multiple difficulties. Many game elements are also only unlocked over time, as more Joker cards are added to the starting pool. More",
    "score": 90
  },
  {
    "name": "Mario + Rabbids: Sparks of Hope",
    "img": "https://cdn.mobygames.com/covers/19465579-mario-rabbids-sparks-of-hope-nintendo-switch-front-cover.jpg",
    "descripcion": "Team up with Mario, Luigi, Princess Peach, Rabbid Peach, Rabbid Luigi, and their friends on a galactic journey to defeat a malevolent entity and save your Spark companions. Explore planets throughout the galaxy as you uncover mysterious secrets and compelling quests! •Build your dream team with three heroes from an eclectic roster of nine. •Take down all new bosses, along with some familiar enemies throughout the galaxy. •Rescue the adorable Sparks throughout the galaxy, who provide distinct powers that will help you in battle. •Unleash your heroes' skills but be strategic as you dash your enemies, team jump on your allies, and hide behind covers. Source: Nintendo.com Description",
    "score": 86
  },
  {
    "name": "Super Mario Maker 2",
    "img": "https://cdn.mobygames.com/covers/535655-super-mario-maker-2-nintendo-switch-front-cover.png",
    "descripcion": "Make it Your Way, Play it Your Way. Mario fans of the world, unite! Now you can play, create, and share* the side-scrolling Super Mario™ courses of your dreams in the Super Mario Maker™ 2 game, available exclusively on the Nintendo Switch™ system! Dive into the single-player Story Mode and play built-in courses to rebuild Princess Peach’s castle. Make your own courses, alone or together. And with a Nintendo Switch Online membership*, share your courses, access a near-endless supply made by others, enjoy online multiplayer, and more! A new side-scrolling Mario adventure that unleashes the creative potential of Super Mario Maker 2 awaits in Story Mode, which contains over 100 built-in courses. And in Course Maker, a wide range of parts, tools, and more are available so you can construct your own courses. Want coin-shooting cannons? Bowser riding on a giant Goomba? Cat Mario sliding down slopes to take out an army of baddies? Go for it! You call the shots. Pass a Joy-Con™ controller to a partner to build cooperatively on a single system! Power-up the fun even further with a Nintendo Switch Online membership, which gives you access to Course World and its wealth of online content and functionality. Track your rankings, share your creations, and leave comments after you’ve played courses. With a Nintendo Switch Online membership, you can also tackle Endless Challenge, save online courses locally for later offline play, enjoy online multiplayer with players both near and far, and customize how you appear to others by dressing your Mii™ character with fun accessories! Source: Nintendo.com Description",
    "score": 86
  },
  {
    "name": "Tsukihime: A piece of blue glass moon",
    "img": "https://cdn.mobygames.com/covers/8862216-tsukihime-a-piece-of-blue-glass-moon-playstation-4-front-cover.jpg",
    "descripcion": "This remake of the 2000 game Tsukihime is a retelling of the original with entirely new art and a significantly different story, including new characters. Shiki Tohno, heir to the Tohno family, has a strange secret. Following a near-fatal car accident as a child, he's gained the ability to see the threads of fate and foresee anyone's death. After years spent banished to a remote branch family household, he's called back home by his sister where he has to adapt to life back home in the family household. Depending on player choices, the plot can branch. This remake contains the two core \"near side of the moon\" routes from the original game, with branching plots focusing on two specific characters. In one route, the plot follows Shiki's encounters with a vampire named Arceuid Brunestud and her conflicts with a sect of powerful vampiric foes. In another, he becomes close with his upperclassmate Ciel, who turns out to be a vampire hunter who's targeting a powerful vampire named Roa Valdamjong. The \"far side\" routes, side stories focusing on other characters, are planned for inclusion in the upcoming game Tsukihime: Another side of red garden.",
    "score": 88
  },
  {
    "name": "Animal Well",
    "img": "https://cdn.mobygames.com/covers/18631397-animal-well-windows-front-cover.jpg",
    "descripcion": "Hatch from your flower and spelunk through the beautiful and sometimes haunting world of Animal Well, a pixelated wonder rendered in intricate audio and visual detail. Encounter lively creatures small and large, helpful and ominous as you discover unconventional upgrades and unravel the well’s secrets. This is a truly unique experience that can make you laugh in fear, surprise, or delight. Dense atmospheric puzzle box world with tons of secrets Light candles for safety and gradually fill out your map Nonlinear -- explore and collect items in whatever order you choose Enemies, environment, and items interact in surprising and systemic ways All items have multiple uses Learn how innocuous details can become meaningful The main game is just the beginning. Players will be discovering hidden puzzles for years Assess for yourself what is safe and dangerous Focus on tension and suspense rather than action You are disempowered, but can make clever use of your environment and items Source: Steam Store Description",
    "score": 89
  },
  {
    "name": "Monster Hunter: Rise",
    "img": "https://cdn.mobygames.com/covers/9451853-monster-hunter-rise-nintendo-switch-front-cover.jpg",
    "descripcion": "Monster Hunter: Rise is a action role-playing game and the sixth mainline installment in the Monster Hunter series. The game takes place in a world known as the \"New World,\" where players control a hunter who travels to different locations to hunt down large, dangerous creatures known as \"Monsters.\" The goal of the game is to complete quests and hunt these monsters to gain resources and materials which can then be used to craft weapons and equipment to make the hunter stronger and better equipped to take on even tougher monsters. In terms of gameplay, it features both single player and multiplayer options. Players have access to a variety of weapons, each with unique playstyles and abilities, to use in battle against the monsters. The game also features a variety of mechanics such as traps, environmental interactions, and mounted combat, to help players bring down the monsters they are hunting. In addition to hunting, players can also collect resources, complete quests, and craft new equipment to enhance their abilities. Some of the distinctive features include the new \"Wirebug\" mechanic, which allows players to traverse the environment and attack monsters with increased mobility, and the new \"Palamute\" companion, a dog-like creature that can be used in battle to assist the player. The game also introduces a new setting, the \"Sacred Land of the Lusha,\" as well as new monsters to hunt and new weapons to craft.",
    "score": 85
  },
  {
    "name": "Kirby and the Forgotten Land",
    "img": "https://cdn.mobygames.com/covers/6547361-kirby-and-the-forgotten-land-nintendo-switch-front-cover.jpg",
    "descripcion": "Float off on an all-new adventure as the powerful puffball, Kirby. Explore in 3D stages as you discover a mysterious world with abandoned structures from a past civilization—like a shopping mall?! Copy enemies’ abilities like the new Drill and Ranger and use them to attack, explore your surroundings, and save the kidnapped Waddle Dees from the ferocious Beast Pack alongside the mysterious Elfilin. Hope you’re hungry for an unforgettable adventure! Get a mouthful of real-world objects for all-new, powerful transformations Feeling hungry? Kirby can inhale real-world objects and transform using Mouthful Mode! Why get one drink from a vending machine when you can swallow the whole thing? Then, use your boxy body to shoot out cans at baddies. Consume a car to gain some wheels and slam through walls. Sit back and take it all in...literally. Join up with a pointy partner, Bandana Waddle Dee, in co-op play Pass a Joy-Con™ controller to a buddy to play as the spear-wielding Bandana Waddle Dee and help each other explore and battle through this colorful world. While Kirby can float and inhale enemies, Bandana Waddle Dee can spin and stab with his sturdy spear. Find friendship in this forgotten world and save the Waddle Dees! Float over obstacles and fight through enemies on your way to each stage’s goal as you slash, poke, freeze, and hammer using Kirby’s copy abilities. The tough puff is truly put to the test in dynamic boss battles that will keep you dancing about the arena. Choose from two difficulty modes for either a light, breezy adventure or a more challenging experience. Each themed stage you travel through will hide several friendly Waddle Dees in peril! Save them to grow the home base of your adventure, the once-deserted Waddle Dee Town. The Waddle Dees you rescue will unlock shops, leaderboards, and the ability to evolve copy abilities to make them stronger. You’ll also be able to enjoy some of the townsfolk’s favorite games. Use compatible amiibo™ accessories* or Present Codes at Waddle Dee-liveries for useful in-game items. Track down cute collectibles to give Kirby’s house some extra charm either at the Gotcha Machine Alley or during your adventure. Source: Nintendo.com Description",
    "score": 85
  },
  {
    "name": "Shin Megami Tensei V",
    "img": "https://cdn.mobygames.com/covers/11260327-shin-megami-tensei-v-nintendo-switch-front-cover.jpg",
    "descripcion": "When a grisly murder scene in modern-day Tokyo blocks our protagonists walk home, an unplanned detour leaves him buried and unconscious. He awakens in a new Tokyo, a wasteland ravaged by apocalypse now called Da’at... but before bloodthirsty demons can claim his life, a savior emerges, and they unite to become a mighty being neither human nor demon: a Nahobino. With newfound power, the protagonist ventures through Da’at, an enigmatic realm filled with mythical deities and demonic tyrants in constant conflict for survival. Searching for answers, the protagonist must forge his own path in a battle between light and dark to dictate the fate of the world. Source: Nintendo.com Description",
    "score": 85
  },
  {
    "name": "Undertale",
    "img": "https://cdn.mobygames.com/covers/712796-undertale-linux-front-cover.jpg",
    "descripcion": "Years after a devastating war between humans and monsters, a child has fallen through a hole and into the monsters' underground world. Under the care of a kindly monster woman named Toriel, they learn the basics of the underground world, including that they may be attacked by other monsters who are less friendly. After the child leave's Toriel's care, it's up to them how they proceed through the underground, including whether they kill the monsters in their way or try to find peaceful resolutions to conflict. Undertale is an Eastern RPG with some action aspects in its combat system. In the overworld, the player explores areas, solves puzzles, and talks to NPCs. When a battle is triggered, typically through random encounter, the game switches to the combat screen. A heart representing the child's soul appears in a small box, in which objects representing the monsters' attacks appear and must be dodged in real time. On the child's turn, they can attack monsters more directly through the fight command. A meter that determines the strength of the player's attack must be hit with good timing in order to deal more damage. Alternatively, players may choose to perform friendly actions in battle or show mercy to the opponent in order to resolve conflict without bloodshed. It is possible to finish every encounter in the game without killing anyone, though some monsters are more difficult to do this with than others. The player may need to perform certain actions in the overworld before some monsters can be befriended. Although only one Undertale save file can be kept at a time, the game remembers certain player actions across playthroughs, mainly in reference to how violent or peaceful they were. Resetting to an earlier save or starting a new game after specific actions are taken can affect how some NPCs treat the player and how the story is ultimately resolved. More",
    "score": 83
  },
  {
    "name": "Persona 4 Golden",
    "img": "https://cdn.mobygames.com/covers/6989549-persona-4-golden-ps-vita-front-cover.png",
    "descripcion": "Persona 4 Golden is an updated version of Persona 4. It has been enhanced with high-resolution visuals, new animation sequences, new social links, events and endings, as well as a new part of town. It also has more available Personas.",
    "score": 90
  },
  {
    "name": "Xenoblade Chronicles: Definitive Edition",
    "img": "https://cdn.mobygames.com/covers/17678894-xenoblade-chronicles-definitive-edition-nintendo-switch-front-co.jpg",
    "descripcion": "Xenoblade Chronicles: Definitive Edition is a remake of the original Xenoblade Chronicles with updated graphics and a somewhat different art style. Changes in content are minimal, and mostly consist of quality of life features such as difficulty settings, an improved quest tracker, and fashion gear. New content includes a time trials mode and a handful of new equipment sets. Definitive Edition also includes a brand-new epilogue chapter, Future Connected, which can be accessed at any time independent of progress in the main game. One year after the events of the original game, Shulk and Melia set off for the imperial city of Alcamoth, of which the latter is crown princess. However, a malevolent, incorporeal being called the Fog King has appeared in the city from a rift in space-time and driven the residents to the Bionis' Shoulder. Tensions between the survivors have fractured their community, leaving them with little hope of ever returning to their homeland. Melia takes it upon herself to reunite her people and retake the capital, and in the process prove her worth as heir to the throne. Shulk and Melia are joined in their quest by a pair of Nopon named Nene and Kino, children of Riki who wish to follow in their father's footsteps and become heroes. The party are also able to recruit the Ponspectors, a Nopon survey crew who offer their assistance in battle. In addition to randomly jumping in to use special skills, the Ponspectors can combine their power to launch an all-out attack against the enemy. Other mechanics from the main game have been streamlined or removed to better fit the shorter campaign.",
    "score": 85
  },
  {
    "name": "Diablo III: Eternal Collection",
    "img": "https://cdn.mobygames.com/covers/17473512-diablo-iii-eternal-collection-playstation-4-front-cover.jpg",
    "descripcion": "A compilation of the following games: Diablo III Diablo III: Reaper of Souls Diablo III: Rise of the Necromancer For the Nintendo Switch, this is the first release of the game.",
    "score": 86
  },
  {
    "name": "Neon White",
    "img": "https://cdn.mobygames.com/covers/17872456-neon-white-nintendo-switch-front-cover.jpg",
    "descripcion": "Neon White is a lightning fast first-person action game about exterminating demons in Heaven. You are White, an assassin handpicked from Hell to compete with other demon slayers for a chance to live permanently in Heaven. The other assassins seem familiar, though… did you know them in a past life? Features: • You play as Neon White, an assassin plucked from Hell to compete with other demon slayers for a shot at redemption. • Collect “Soul Cards” to attack your foes or discard them to use unique movement abilities. • Compete for the best times by cleverly combining cards to discover massive shortcuts. • Uncover Heaven’s mysteries by getting to know the other assassins… did you know them in a past life? Source: Steam Store Description",
    "score": 87
  },
  {
    "name": "Unavowed",
    "img": "https://cdn.mobygames.com/covers/3509342-unavowed-windows-front-cover.jpg",
    "descripcion": "A demon possessed you one year ago. Since that day, you unwillingly tore a trail of bloodshed through New York City. Your salvation comes in the form of the Unavowed – an ancient society dedicated to stopping evil. You are free, but your world is in tatters. You have no home, no friends, and are wanted by the police. Your old life is gone, but perhaps you can start a new one. Join the ranks of the Unavowed, and fight against the oncoming darkness. Features: Choose a male or female protagonist Three playable origin stories Branching storyline A total of four companion characters to choose from, each with their own talents and abilities. Twice the resolution of a typical Wadjet Eye Game! All the usual guff – voice acting, commentary, original music, etc Source: Steam Store Description",
    "score": 86
  },
  {
    "name": "Atari 50: The Anniversary Celebration",
    "img": "https://cdn.mobygames.com/covers/11139367-atari-50-the-anniversary-celebration-xbox-one-front-cover.jpg",
    "descripcion": "Join the celebration! Atari 50: The Anniversary Celebration takes you on an interactive journey through 50 years of video games. At the heart of Atari 50 are the Interactive Timelines, which combine historical trivia, digital artifacts, over 60 minutes of new interviews, documentary footage, and playable games into one cohesive experience. When you encounter a game in the Timelines, you can immediately play it without losing your place. The massive selection of over 100 games spans seven different platforms: Arcade, 2600, 5200, 7800, Atari 8-bit computers, and, for the first time ever on modern consoles, Atari Lynx and Jaguar! Play the classics like Tempest 2000, Asteroids, and Yars' Revenge, or dive into some deeper cuts. Behind every game are the stories of Atari, what was happening at the company, and what went into the creation of the games and the hardware on which they ran, all told by the people who were there. Also includes six new games: Swordquest: AirWorld – Yes, you read that right: After nearly 40 years of waiting, the team at Digital Eclipse has created a new entry in the legendary Swordquest series, inspired by the design concepts of original Swordquest creator Tod Frye. Who will be the first to solve its mysteries – and finally complete the quest? Haunted Houses – The original “survival horror” game for the Atari 2600 gets a modern 3D voxel-based sequel, featuring more houses, more spooky situations, and more urns. VCTR-SCTR – This mashup celebration of the vector era of gaming combines the gameplay from Asteroids, Tempest, and other vector-based arcade classics into a single, continuous challenge. Neo Breakout – An amazing and addictive two-player competition that combines the best features of Breakout and Pong, with a modern graphic style Quadratank – The first new entry in the classic Tank series since 1978 combines features from the original games with four-player fun in team or free-for-all modes. Yars’ Revenge Reimagined – The Atari 2600 masterpiece gets a whole new look. Swap between original and modern graphics at any time! Source: Steam Store Description",
    "score": 86
  },
  {
    "name": "Return to Monkey Island",
    "img": "https://cdn.mobygames.com/covers/10924881-return-to-monkey-island-linux-front-cover.jpg",
    "descripcion": "Return to Monkey Island is a point-and-click adventure and a direct sequel to Monkey Island 2: LeChuck's Revenge (1991). It has the original creator Ron Gilbert back at the helm and picks up directly after the events of that game. However, it also incorporates and acknowledges the characters and events from later titles such as The Curse of Monkey Island (1997), Escape from Monkey Island (2000) and Tales of Monkey Island (2009). This game focuses on the series' protagonist Guybrush Threepwood as he sets out to finally reveal the secret of the Monkey Island. A short prelude explains the ending of the previous game, why this title is told as a flashback and an optional scrapbook available in the main menu is provided with a brief history of the events of all games. The adventure is divided in several parts and starts on Mêlée Island where Guybrush, reprised by Dominic Amato, once again finds himself without a ship and crew to travel to Monkey Island. Mêlée island has also changed, with Carla the swordmaster as the new governor, Elaine advocating social and health issues, and a new pirate leadership refusing to fund Guybrush's venture. Many characters from all titles return in this game, such as Stan the salesman, Otis, Wally the map maker, the Voodoo Lady and Murray the talking skull, but also many new characters. Next to the familiar Monkey Island and Mêlée Island there are entirely new locations such as Brr Muda and Terror Island. A classic point-and-click interface is used to experience the story, talk to characters and solve puzzles. When hovering over a character or object, usually one or two options are provided: to examine and to interact. Items can be picked up and are stored in an inventory where they can be combined or used in the environment. There is also a todo list as an inventory item where quests are tracked. A separate action is available to highlight all hotspots in the environment. The game can be played in an easy Casual mode or the Hard more with more puzzles. There is also a separate Writer's Cut option with more text and dialogue, available for both modes. Hints are provided through another in-game item, a hint book provided by the Voodoo Lady. The environment is also littered with optional trivia cards stored in a trivia book. Players need to answer a question about the series. If it is answered incorrectly the card disappears. The game retains its humorous approach, often breaking the fourth wall. The game uses an entirely new visual style headed by Rex Crowle and similar to the one used in his game Knights and Bikes (2019). It aims to resemble a picture book or a pop-up book with exaggerated character features, using 2D and no longer the pixel art of the original two games or the sharp cartoon or 3D look from later titles. The original composers also return with new music. More",
    "score": 84
  },
  {
    "name": "Minecraft: Nintendo Switch Edition",
    "img": "https://cdn.mobygames.com/covers/9053376-minecraft-nintendo-switch-edition-nintendo-switch-front-cover.png",
    "descripcion": "Craft, create, and explore alone, or with up to four players in split-screen and up to eight online. Minecraft is a game about placing blocks and going on adventures. Explore randomly-generated worlds and build amazing things from the simplest of homes to the grandest of castles. Play in Creative Mode with unlimited resources or mine deep into the world in survival mode, crafting weapons and armour to fend off the dangerous mobs. Source: Nintendo.com Description",
    "score": 84
  },
  {
    "name": "The Elder Scrolls V: Skyrim - Special Edition",
    "img": "https://cdn.mobygames.com/covers/11072190-the-elder-scrolls-v-skyrim-special-edition-xbox-one-front-cover.jpg",
    "descripcion": "The Elder Scrolls V: Skyrim - Special Edition is a reworked version of The Elder Scrolls V: Skyrim. It includes the main game as well as the add-ons (Dawnguard, Dragonborn and Hearthfire), updated graphics, and mod support for the console versions. These mods allow for new quests, environments, characters, dialogue, armor, weapons and more. This is the first release of the game for PS4 and Xbox One. The PC version of this Special Edition which already had all the original content and mods is provided for free through Steam for owners of the base game and three DLC items or The Elder Scrolls V: Skyrim - Legendary Edition.",
    "score": 84
  },
  {
    "name": "Jack Jeanne",
    "img": "https://cdn.mobygames.com/covers/9910427-jack-jeanne-nintendo-switch-front-cover.jpg",
    "descripcion": "The game takes place in a performing arts school called the Univers Opera School. Since the game is an otome, players take on the role of Kisa Tachibana, a female who is forced to hide her identity in the all-men’s school. Tachibana hopes to re-kindle her passion for the theater by attending the opera school. Most of the game’s focus is on Tachibana’s participation in the final and most important show of the year, all the while trying to keep her identity a secret. Jack Jeanne focuses on Tachibana’s efforts to achieve what is called a “Quartz”, which is basically the top-ranking spot in every theater class. The game’s title derives upon the characters’ stage names; men who play a male role are referred to as Jack, while men who play a female role are referred to as Jeanne. The gameplay revolves around on two parts: the simulation aspects, in which you strengthen your bond with your classmates as the protagonist Tachibana and follows her story into the game; and the rhythm aspects, which are just the shows that the students perform while dancing in full 3D.",
    "score": 84
  },
  {
    "name": "AI: The Somnium Files",
    "img": "https://cdn.mobygames.com/covers/10820606-ai-the-somnium-files-windows-front-cover.jpg",
    "descripcion": "Kaname Date is a detective working for the Tokyo Metropolitan Police, who lost his memories and left eye after an incident six years ago. Assisting him in his police work is Aiba, an advanced AI housed in his prosthetic eye. In addition to normal detective activities such as examining crime scenes and gathering testimonies, Date and Aiba are able to dive into a person's dream world, or Somnium, in order to uncover the truth a subject's conscious self can't or won't reveal. Date's newest investigation focuses on the death of a woman named Shoko Nadami, whose corpse was discovered with her left eye missing. As more bodies are discovered, each missing the left eye, it becomes apparent that they are the work of a serial killer dubbed the New Cyclops Killer. The more Date digs into the increasingly-complex case, the more it seems that it may have some connection to his missing memories and the Original Cyclops Serial Killings of six years ago... Gameplay is divided into real world and Somnium segments. In the real world, Date examines crime scenes and talks to persons of interest in a point-and-click format. When normal human vision is insufficient, Aiba's special vision modes can be used to examine the environment. Violent confrontations play out as quick time events in which Aiba runs simulations to guide Date through the fight safely. In Somnium, the player directly controls Aiba in a subject's dream. Although there is a strict time limit of six real-world minutes, the perception of time is different in a dream. Thus, instead of having to contend with a constantly ticking clock, each action the player performs will shave a different amount of time off of the 360-second total, and players are given limited opportunities to change the length of time an action will take. By interacting with objects and solving puzzles based on dream logic, Aiba can break a subject's mental locks and uncover the truth. Certain Somnia have multiple solutions, which will send the player down different story paths. Only by playing every path can the case be fully solved. More",
    "score": 83
  },
  {
    "name": "NEO: The World Ends with You",
    "img": "https://cdn.mobygames.com/covers/10314334-neo-the-world-ends-with-you-nintendo-switch-front-cover.jpg",
    "descripcion": "Rindo comes to the grim realization that his life is on the line when he is forced to compete in the so-called \"Reapers' Game.\" There's no telling how this tale will unfold—but it's up to you to find out! Put your psychic prowess to the test as you duke it out on the stylishly animated streets of Shibuya. ＜Story＞ It was just an ordinary day in Shibuya—or so Rindo thought, until he comes into possession of a mysterious pin and gets wrapped up in the so-called “Reapers’ Game”... Source: Nintendo.com Description",
    "score": 84
  },
  {
    "name": "Monster Boy and the Cursed Kingdom",
    "img": "https://cdn.mobygames.com/covers/3597572-monster-boy-and-the-cursed-kingdom-nintendo-switch-front-cover.jpg",
    "descripcion": "A legendary series returns with a grand new adventure! Enjoy a colorful action-adventure game made alongside Ryuichi Nishizawa, creator of the original Wonder Boy in Monster World series. Monster Boy and the Cursed Kingdom borrows the best from the classic series to deliver a fresh, modern adventure with fun gameplay, memorable music and gorgeous hand drawn animations. Can Jin save Monster World Kingdom? Help our young hero defeat challenging enemies, discover hidden locations, upgrade powerful equipment, and more! You'll also unlock special forms with unique skills used to open new paths where mighty bosses and secret treasures await. Feature Overview: Six awesome forms with unique combat and platforming abilities to make your adventure exciting from start to finish. Unlock new paths and secrets with special equipment: look for magic weapons and items that gradually open up the world. Over 15 hours of epic adventure: explore the new Monster World in a vast interconnected environment. Hand Drawn animations: characters and enemies come to life with detailed animations and fun facial expressions. Soundtrack from iconic Japanese composers: Yuzo Koshiro, Motoi Sakuraba, Michiru Yamane, Keiki Kobayashi and Takeshi Yanagawa. Source: Steam Store Description",
    "score": 84
  },
  {
    "name": "Rocket League",
    "img": "https://cdn.mobygames.com/covers/563180-rocket-league-linux-front-cover.jpg",
    "descripcion": "Rocket League is the sequel to Supersonic Acrobatic Rocket-Powered Battle-Cars. It is a vehicle based, futuristic variant of football (soccer). Just like the original game it is played in a large arena with two teams of cars. As with football the goal is to score by launching a giant ball into the goal of the opposing team. The arena has curved edges with large walls, so the ball cannot leave the pitch and bounces back, and it is possible to drive up the sides. Cars have no means of attack and no health bar, but it is possible to ram other cars to hinder them. Vehicles also have the ability to jump and use nitro. Nitro boosts are limited, but can be refilled by driving over certain sections of the pitch. By winning matches experience is earned to level up and unlock new parts. The car can be fully customized in a garage with different types of bodies, colours, wheels, decals, nitro trails etc. which is new for this version. Next to one-time exhibition matches and online games, it has a full season mode. The player sets up a season and determines the length (number of weeks), difficulty (rookie, pro, all-star), play-offs and the team size, with multiple matches in succession. Matches generally last five minutes. The game supports both offline (split-screen for up to four players) and online multiplayer. Matches can be played with two to up to eight players and online games support both ranked and unranked playlists. Multiplayer is platform independent. When playing alone team mates are controlled by the AI. The tutorial consists of several mini-games based on three categories: defence, offence, and aerial play. While playing a small arrow shows the location of the ball when it is in the air and the camera can be rotated around the car to keep track of the action. After scoring the ball is returned to the middle and the cars are flown back to their side of the pitch. More",
    "score": 80
  },
  {
    "name": "The Legend of Zelda: Echoes of Wisdom",
    "img": "https://cdn.mobygames.com/covers/19782769-the-legend-of-zelda-echoes-of-wisdom-nintendo-switch-front-cover.jpg",
    "descripcion": "Save Hyrule—this time with the wisdom of Princess Zelda! The people of Hyrule are being stolen away by strange rifts—with a certain swordsman as well as the King of Hyrule and his advisors among the missing. Left alone, it’s up to Princess Zelda to save her kingdom in a brand-new adventure in The Legend of Zelda™ series! Team up with the ethereal creature Tri and use the Tri Rod to create “echoes,” which are imitations of things you find in the environment—then recreate those echoes whenever you like to solve puzzles and defeat enemies. Use echoes like water blocks to reach new heights, make bridges out of old beds, throw rocks at foes, or find your own combination of echoes to do things your way. You can even make echoes of monsters to fight at your side in combat! Use a variety of abilities to conquer rifts and dungeons across a vast Hyrule To close the rifts to the Still World and save the people trapped inside, Zelda and Tri must first enter each rift. Once inside, they must use their combined powers to traverse broken terrain and dungeons with challenging bosses. You'll need more than just your echoes to get past all the obstacles in your way. Use Bind to make objects follow Zelda’s movements, or Reverse Bond to follow an object’s movements. You can also use a mysterious sword to transform into the powerful swordfighter form for a short time. With these abilities at your disposal, you’ll be fully equipped to tackle each challenge in your own way! Your search for the rifts will span far and wide and bring you into contact with plenty of folks who will make requests of you. Luckily you can use waypoints or a horse to get around! Travel off the beaten path to discover side quests and minigames As you explore Hyrule, you’ll encounter all kinds of interesting folk—those dealing with problems great and small, and even some that just want to give you a fun challenge! You’ll even meet the engineer Dampé, helping him to create automatons and use them to attack and stun enemies. Equip accessories and visit Smoothie Shops for bonus effects Try on different outfits and accessories to gain various effects such as increasing appearance of hearts or ability to jump higher. Visit a Smoothie Shop to blend up your ingredients into tasty drinks capable of replenishing your hearts and granting temporary bonuses like resistance to electricity. Scan any The Legend of Zelda™ themed amiibo™ figures* to get rewards, like smoothie ingredients and certain outfits in alternate colors. Source: Nintendo.com Description",
    "score": 84
  },
  {
    "name": "The Legend of Zelda: Link's Awakening",
    "img": "https://cdn.mobygames.com/covers/10116896-the-legend-of-zelda-links-awakening-nintendo-switch-front-cover.jpg",
    "descripcion": "The 2019 Switch version of The Legend of Zelda: Link's Awakening is a remastered/re-rendered version of the 1993 Game Boy version using partial elements from the 1998 Game Boy Color (DX) version. The general consensus of the story and it’s plot-line still remain true to the original and have been slightly changed in some places with additions/removals of various non-significant elements which don’t hold up in the Switch version, when compared to the originals. Besides the complete graphical and sound/music overhaul to represent a \"clay-like motion\" feel to the game, it's gameplay controls have been changed to incorporate the additional buttons the Switch holds as opposed to the 2-button choice of the Game Boy. In the original, Link had to change his equipment depending his situation, setting them to the A and B buttons on the fly. The Switch version automatically assigns the Sword and Shield to pre-allocated buttons, whilst the other buttons can be designated to the other in-game items at the user’s preferences. The graphical limitation of the original meant the areas loaded and shifted whilst Link was traversing from one screen area to another. The Switch version area traversal progression overlaps when Link runs from one to another. The overworld map is far more detailed and can be zoomed in to distinguish individual rocks and trees and suspicious locations can now be marked to be returned to on a later occasion. The mini-game shop in Mabe Village, which plays a part in the trading item quest has new decorative items as prizes, which can be set at different locations all over Koholint Island. Additional heart-pieces can also be won extending the heart meter to a total of 20 instead of the 14 hearts of the original. Other new items include Fairy Bottles in which Link can now catch fairies to hold for a later time. The original quest of finding hidden seashells, which resulted in obtaining the best sword in the original, has now been made easier with the addition of the Seashell Sensor, obtained at gathering 20 shells. When equipped a ping is sent out when in the proximity of a hidden shell. The total amount of hidden seashells has been increased when compared to the ones available in the original. One other place to gather additional heart pieces is at Dampe's stone shack, located on the former place of Photographer's House from Link’s Awakening DX. Dampé hosts the newly added \"Chamber Dungeons\" in which the player can create his/her own dungeon using the pieces from dungeons one has completed already. An accompanying new released Link amiibo allows the player to save newly created dungeons to show at other people's game. When scanning this amiibo, one can also encounter \"Dark Link\" in the player's made-up dungeons. More",
    "score": 84
  },
  {
    "name": "Donkey Kong Country: Tropical Freeze",
    "img": "https://cdn.mobygames.com/covers/7023187-donkey-kong-country-tropical-freeze-wii-u-front-cover.jpg",
    "descripcion": "Donkey Kong Country: Tropical Freeze is the fifth game in the Donkey Kong Country series and was released exclusively for Nintendo Wii U and later ported to the Nintendo Switch. While celebrating Donkey Kong’s birthday the Kong family witnesses how an invasion fleet of arctic creatures (Snowmad) arrives. The island is frozen over and their flagship takes position on top of the island. This can't go unpunished so the Kong family is off to take back the island. Like the others in the series is a side-scrolling platform game in 2D view where, as usual, you can control Donkey Kong, Diddy Kong as well as Dixie Kong and now also the grumpy old man Cranky Kong. All are playable, each with their own special abilities that give you an advantage in a specific type of terrain. Along the way the classic K-O-N-G letters as well as puzzle pieces can be collected to offer an extra challenge. While you platform you way through the various regions of the island, you have to overcome various enemies and bosses. Balloons serve as lives, with every hundred bananas collected awarding you one extra balloon. The Switch version includes the new Funky Mode, starring the surfing simian Funky Kong, which unlocks a range of gameplay updates and an alternative way to play the game by using his unique abilities. Funky's health is superior to the player characters that were available in the Wii U version only.",
    "score": 85
  }
]